#include<stdio.h>
int main()
{
   /*二维数组定义格式和遍历方式
   1.
   缺点：要求长度一样
   m：表示二维数组的长度
   n：表示每一个一维数组的长度
   数据类型 arr[m][n]=
   {
        {1,2,3,4....},
        {1,2,3,4....},
        {1,2,3,4....}
    };
        利用遍历索引遍历或者利用指针遍历
   */

   int arr[3][5]=
   {
    {1,2,3,4,5},
    {11,22,33,44,55},
    {111,222,333,444,555}
   };

   //利用索引的方式遍历
   //arr[0]表示二维数组当中的第一个一维数组{1,2,3,4,5}
   //arr[1]表示二维数组当中的第二个一维数组{11,22,33,44,55}
   for(int i=0;i<3;i++)
   {
    //i依次表示二维数组中的索引
    for(int j=0;j<3;j++)
    {
        //i依次表示一维数组中的索引
        //内循环：遍历每一个一维数组
        printf("%d ",arr[i][j]);
    }
    //当内循环结束之后表示一维数组遍历完毕
    printf("\n");
   }

   return 0;
}