#include<stdio.h>
int main()
{
    /*
    二维数组
    利用指针遍历二维数组
    */

    //1.定义三个一维数组
    int arr1[5]={1,2,3,4,5};
    int arr2[5]={11,22,33,44,55};
    int arr3[5]={111,222,333,444,555};
    //2.把三个数组的内存地址放到一维数组当中
    int *arr[3]={arr1,arr2,arr3};
    //3.获取数组
    //数据类型 *指针名=
    int* *p=arr;
    //4.遍历指针
    for (int i = 0; i < 3; i++)
    {
        for (int j = 0; j < 5; j++)
        {
           printf("%d ",*(*p+j));
        }
        printf("\n ");
        p++;
        
    }
    
   return 0;
}
/*补充
数组指针和指针数组

数组指针：指向数组的指针
作用：方便的操作数组中的各种数据
举例：int* p=arr          步长为：int 4字节
举例：int(*p)[5]=&arr     步长为：int乘5 20字节

指针数组：存放指针的数组
作用：用来存放指针
举例：int*p[5],这个数组里面存着int类型的指针
int arr1[5]={1,2,3,4,5};
int arr2[5]={11,22,33,44,55};
int* arr[2]={arr1,arr2};
*/